---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem.BeginConnectorIndex
source: html/4d6c6f2b-e921-e019-7386-dc55dc52eb0a.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem.BeginConnectorIndex Property

The index of the begin connector of the flow path

## Syntax (C#)
```csharp
public int BeginConnectorIndex { get; }
```